{"format": "layers-model", "generatedBy": "keras v2.10.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.10.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_ids"}, "name": "input_ids", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "int32", "sparse": false, "ragged": false, "name": "attention_mask"}, "name": "attention_mask", "inbound_nodes": []}, {"class_name": "TFGPT2Model", "config": {"vocab_size": 50258, "n_positions": 1024, "n_embd": 768, "n_layer": 12, "n_head": 12, "n_inner": null, "activation_function": "gelu_new", "resid_pdrop": 0.1, "embd_pdrop": 0.1, "attn_pdrop": 0.1, "layer_norm_epsilon": 1e-05, "initializer_range": 0.02, "summary_type": "cls_index", "summary_use_proj": true, "summary_activation": null, "summary_first_dropout": 0.1, "summary_proj_to_labels": true, "scale_attn_weights": true, "use_cache": true, "scale_attn_by_inverse_layer_idx": false, "reorder_and_upcast_attn": false, "bos_token_id": 50256, "eos_token_id": 50256, "return_dict": true, "output_hidden_states": false, "output_attentions": false, "torchscript": false, "torch_dtype": null, "use_bfloat16": false, "tf_legacy_loss": false, "pruned_heads": {}, "tie_word_embeddings": true, "is_encoder_decoder": false, "is_decoder": false, "cross_attention_hidden_size": null, "add_cross_attention": false, "tie_encoder_decoder": false, "max_length": 20, "min_length": 0, "do_sample": false, "early_stopping": false, "num_beams": 1, "num_beam_groups": 1, "diversity_penalty": 0.0, "temperature": 1.0, "top_k": 50, "top_p": 1.0, "typical_p": 1.0, "repetition_penalty": 1.0, "length_penalty": 1.0, "no_repeat_ngram_size": 0, "encoder_no_repeat_ngram_size": 0, "bad_words_ids": null, "num_return_sequences": 1, "chunk_size_feed_forward": 0, "output_scores": false, "return_dict_in_generate": false, "forced_bos_token_id": null, "forced_eos_token_id": null, "remove_invalid_values": false, "exponential_decay_length_penalty": null, "suppress_tokens": null, "begin_suppress_tokens": null, "architectures": ["GPT2LMHeadModel"], "finetuning_task": null, "id2label": {"0": "LABEL_0", "1": "LABEL_1"}, "label2id": {"LABEL_0": 0, "LABEL_1": 1}, "tokenizer_class": null, "prefix": null, "pad_token_id": null, "sep_token_id": null, "decoder_start_token_id": null, "task_specific_params": {"text-generation": {"do_sample": true, "max_length": 50}}, "problem_type": null, "_name_or_path": "gpt2", "transformers_version": "4.29.2", "model_type": "gpt2", "n_ctx": 1024}, "name": "tfgpt2_model_1", "inbound_nodes": [[["input_ids", 0, 0, {"attention_mask": ["attention_mask", 0, 0]}]]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem", "inbound_nodes": [["tfgpt2_model_1", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, -1, {"start": null, "stop": null, "step": null}]}]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["tf.__operators__.getitem", 0, 0, {}]]]}], "input_layers": [["input_ids", 0, 0], ["attention_mask", 0, 0]], "output_layers": [["dense", 0, 0]]}}, "training_config": {"loss": {"class_name": "SparseCategoricalCrossentropy", "config": {"reduction": "auto", "name": "sparse_categorical_crossentropy", "from_logits": true, "ignore_class": null}}, "metrics": [[{"class_name": "SparseCategoricalAccuracy", "config": {"name": "accuracy", "dtype": "float32"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": {"class_name": "ExponentialDecay", "config": {"initial_learning_rate": 5e-05, "decay_steps": 5480, "decay_rate": 0.95, "staircase": false, "name": null}}, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of119.bin", "group1-shard2of119.bin", "group1-shard3of119.bin", "group1-shard4of119.bin", "group1-shard5of119.bin", "group1-shard6of119.bin", "group1-shard7of119.bin", "group1-shard8of119.bin", "group1-shard9of119.bin", "group1-shard10of119.bin", "group1-shard11of119.bin", "group1-shard12of119.bin", "group1-shard13of119.bin", "group1-shard14of119.bin", "group1-shard15of119.bin", "group1-shard16of119.bin", "group1-shard17of119.bin", "group1-shard18of119.bin", "group1-shard19of119.bin", "group1-shard20of119.bin", "group1-shard21of119.bin", "group1-shard22of119.bin", "group1-shard23of119.bin", "group1-shard24of119.bin", "group1-shard25of119.bin", "group1-shard26of119.bin", "group1-shard27of119.bin", "group1-shard28of119.bin", "group1-shard29of119.bin", "group1-shard30of119.bin", "group1-shard31of119.bin", "group1-shard32of119.bin", "group1-shard33of119.bin", "group1-shard34of119.bin", "group1-shard35of119.bin", "group1-shard36of119.bin", "group1-shard37of119.bin", "group1-shard38of119.bin", "group1-shard39of119.bin", "group1-shard40of119.bin", "group1-shard41of119.bin", "group1-shard42of119.bin", "group1-shard43of119.bin", "group1-shard44of119.bin", "group1-shard45of119.bin", "group1-shard46of119.bin", "group1-shard47of119.bin", "group1-shard48of119.bin", "group1-shard49of119.bin", "group1-shard50of119.bin", "group1-shard51of119.bin", "group1-shard52of119.bin", "group1-shard53of119.bin", "group1-shard54of119.bin", "group1-shard55of119.bin", "group1-shard56of119.bin", "group1-shard57of119.bin", "group1-shard58of119.bin", "group1-shard59of119.bin", "group1-shard60of119.bin", "group1-shard61of119.bin", "group1-shard62of119.bin", "group1-shard63of119.bin", "group1-shard64of119.bin", "group1-shard65of119.bin", "group1-shard66of119.bin", "group1-shard67of119.bin", "group1-shard68of119.bin", "group1-shard69of119.bin", "group1-shard70of119.bin", "group1-shard71of119.bin", "group1-shard72of119.bin", "group1-shard73of119.bin", "group1-shard74of119.bin", "group1-shard75of119.bin", "group1-shard76of119.bin", "group1-shard77of119.bin", "group1-shard78of119.bin", "group1-shard79of119.bin", "group1-shard80of119.bin", "group1-shard81of119.bin", "group1-shard82of119.bin", "group1-shard83of119.bin", "group1-shard84of119.bin", "group1-shard85of119.bin", "group1-shard86of119.bin", "group1-shard87of119.bin", "group1-shard88of119.bin", "group1-shard89of119.bin", "group1-shard90of119.bin", "group1-shard91of119.bin", "group1-shard92of119.bin", "group1-shard93of119.bin", "group1-shard94of119.bin", "group1-shard95of119.bin", "group1-shard96of119.bin", "group1-shard97of119.bin", "group1-shard98of119.bin", "group1-shard99of119.bin", "group1-shard100of119.bin", "group1-shard101of119.bin", "group1-shard102of119.bin", "group1-shard103of119.bin", "group1-shard104of119.bin", "group1-shard105of119.bin", "group1-shard106of119.bin", "group1-shard107of119.bin", "group1-shard108of119.bin", "group1-shard109of119.bin", "group1-shard110of119.bin", "group1-shard111of119.bin", "group1-shard112of119.bin", "group1-shard113of119.bin", "group1-shard114of119.bin", "group1-shard115of119.bin", "group1-shard116of119.bin", "group1-shard117of119.bin", "group1-shard118of119.bin", "group1-shard119of119.bin"], "weights": [{"name": "dense/kernel", "shape": [768, 5], "dtype": "float32"}, {"name": "dense/bias", "shape": [5], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/wpe/embeddings", "shape": [1024, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/wte/weight", "shape": [50258, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._0/ln_1/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._0/ln_1/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._0/attn/c_attn/weight", "shape": [768, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._0/attn/c_attn/bias", "shape": [1, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._0/attn/c_proj/weight", "shape": [768, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._0/attn/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._0/ln_2/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._0/ln_2/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._0/mlp/c_fc/weight", "shape": [768, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._0/mlp/c_fc/bias", "shape": [1, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._0/mlp/c_proj/weight", "shape": [3072, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._0/mlp/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._1/ln_1/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._1/ln_1/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._1/attn/c_attn/weight", "shape": [768, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._1/attn/c_attn/bias", "shape": [1, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._1/attn/c_proj/weight", "shape": [768, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._1/attn/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._1/ln_2/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._1/ln_2/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._1/mlp/c_fc/weight", "shape": [768, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._1/mlp/c_fc/bias", "shape": [1, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._1/mlp/c_proj/weight", "shape": [3072, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._1/mlp/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._2/ln_1/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._2/ln_1/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._2/attn/c_attn/weight", "shape": [768, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._2/attn/c_attn/bias", "shape": [1, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._2/attn/c_proj/weight", "shape": [768, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._2/attn/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._2/ln_2/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._2/ln_2/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._2/mlp/c_fc/weight", "shape": [768, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._2/mlp/c_fc/bias", "shape": [1, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._2/mlp/c_proj/weight", "shape": [3072, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._2/mlp/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._3/ln_1/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._3/ln_1/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._3/attn/c_attn/weight", "shape": [768, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._3/attn/c_attn/bias", "shape": [1, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._3/attn/c_proj/weight", "shape": [768, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._3/attn/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._3/ln_2/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._3/ln_2/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._3/mlp/c_fc/weight", "shape": [768, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._3/mlp/c_fc/bias", "shape": [1, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._3/mlp/c_proj/weight", "shape": [3072, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._3/mlp/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._4/ln_1/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._4/ln_1/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._4/attn/c_attn/weight", "shape": [768, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._4/attn/c_attn/bias", "shape": [1, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._4/attn/c_proj/weight", "shape": [768, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._4/attn/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._4/ln_2/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._4/ln_2/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._4/mlp/c_fc/weight", "shape": [768, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._4/mlp/c_fc/bias", "shape": [1, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._4/mlp/c_proj/weight", "shape": [3072, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._4/mlp/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._5/ln_1/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._5/ln_1/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._5/attn/c_attn/weight", "shape": [768, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._5/attn/c_attn/bias", "shape": [1, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._5/attn/c_proj/weight", "shape": [768, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._5/attn/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._5/ln_2/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._5/ln_2/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._5/mlp/c_fc/weight", "shape": [768, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._5/mlp/c_fc/bias", "shape": [1, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._5/mlp/c_proj/weight", "shape": [3072, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._5/mlp/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._6/ln_1/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._6/ln_1/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._6/attn/c_attn/weight", "shape": [768, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._6/attn/c_attn/bias", "shape": [1, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._6/attn/c_proj/weight", "shape": [768, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._6/attn/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._6/ln_2/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._6/ln_2/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._6/mlp/c_fc/weight", "shape": [768, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._6/mlp/c_fc/bias", "shape": [1, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._6/mlp/c_proj/weight", "shape": [3072, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._6/mlp/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._7/ln_1/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._7/ln_1/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._7/attn/c_attn/weight", "shape": [768, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._7/attn/c_attn/bias", "shape": [1, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._7/attn/c_proj/weight", "shape": [768, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._7/attn/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._7/ln_2/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._7/ln_2/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._7/mlp/c_fc/weight", "shape": [768, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._7/mlp/c_fc/bias", "shape": [1, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._7/mlp/c_proj/weight", "shape": [3072, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._7/mlp/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._8/ln_1/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._8/ln_1/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._8/attn/c_attn/weight", "shape": [768, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._8/attn/c_attn/bias", "shape": [1, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._8/attn/c_proj/weight", "shape": [768, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._8/attn/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._8/ln_2/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._8/ln_2/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._8/mlp/c_fc/weight", "shape": [768, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._8/mlp/c_fc/bias", "shape": [1, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._8/mlp/c_proj/weight", "shape": [3072, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._8/mlp/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._9/ln_1/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._9/ln_1/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._9/attn/c_attn/weight", "shape": [768, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._9/attn/c_attn/bias", "shape": [1, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._9/attn/c_proj/weight", "shape": [768, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._9/attn/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._9/ln_2/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._9/ln_2/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._9/mlp/c_fc/weight", "shape": [768, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._9/mlp/c_fc/bias", "shape": [1, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._9/mlp/c_proj/weight", "shape": [3072, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._9/mlp/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._10/ln_1/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._10/ln_1/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._10/attn/c_attn/weight", "shape": [768, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._10/attn/c_attn/bias", "shape": [1, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._10/attn/c_proj/weight", "shape": [768, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._10/attn/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._10/ln_2/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._10/ln_2/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._10/mlp/c_fc/weight", "shape": [768, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._10/mlp/c_fc/bias", "shape": [1, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._10/mlp/c_proj/weight", "shape": [3072, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._10/mlp/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._11/ln_1/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._11/ln_1/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._11/attn/c_attn/weight", "shape": [768, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._11/attn/c_attn/bias", "shape": [1, 2304], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._11/attn/c_proj/weight", "shape": [768, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._11/attn/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._11/ln_2/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._11/ln_2/beta", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._11/mlp/c_fc/weight", "shape": [768, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._11/mlp/c_fc/bias", "shape": [1, 3072], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._11/mlp/c_proj/weight", "shape": [3072, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/h_._11/mlp/c_proj/bias", "shape": [1, 768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/ln_f/gamma", "shape": [768], "dtype": "float32"}, {"name": "tfgpt2_model_1/transformer/ln_f/beta", "shape": [768], "dtype": "float32"}]}]}